[
  {
    "title": "Elon Musk / Joe Rogan",
    "content": "[00:00:00.090]\nHow much time before there's regular travel back and forth to Mars? Roughly. Like a real civilization on Mars.\n[00:00:17.240]\nWell, I think it's going to take a while to build a real civilization that the real of the threshold that really matters is if we're getting past the great filter is do we have enough resources on Mars such that if the if the spaceships from Earth stop coming, you could survive?\n[00:00:41.400]\nYeah. So that can only be just missing one little thing.\n[00:00:45.810]\nYou'd be like you're on a long sea voyage and the only thing you're missing is vitamin C. Uh, it's only a matter of time, you know. Yeah. And those can be curtains. So you've got to have all the things necessary to sustain civilization on Mars.\n[00:01:03.800]\nAnd the reason that those ships stopped coming could be. World War three, or it could be due to a slow decline of civilization, so civilization here on Earth could end with a bang or a whimper or natural disasters.\n[00:01:19.190]\nYeah, asteroid impacts in the bank category. Yeah, it could be like a whole series of things like. So like what killed the dinosaurs. Well, it wasn't just one thing, you know, it was like a whole bunch of things happened in a row and. You know, while they could have taken any one of those things, they had like three things happen and no dinosaurs, which is kind of amazing that crocodiles are still here.\n[00:01:45.070]\nYeah, those fuckers, well, they're resilient crocodiles that they all that live on decayed meat and they love rotting meat. And so in a any kind of disastrous situation, there's a lot of dead creatures and the crocodiles love it. So that's why they're around crocodiles and bugs and mushrooms and shrews truths, which is why we're here. Yeah, exactly.\n[00:02:14.440]\nOur great, great, great, great, great, great grandparents were. What a strange thing someone like you had to come from. So there's hope.\n[00:02:22.120]\nThere's hope for all you rodents out there. Yeah, well, you can go to Mars. Just keep doing your homework. Absolutely. So so there will be you see the great filter. What did you mean by that?\n[00:02:37.030]\nWell, so there's something called like the Fermi paradox of like, where are the aliens? Yeah. So, you know, where are the aliens? And I think it was Carl Sagan that said, like, if there either are a lot of aliens or none and the either they're equally terrifying. Hmm. If there are a lot of aliens.\n[00:03:05.950]\nWell, I mean, the invasion ship, you know, bug infestation just, you know, like the Starship Troopers style.\n[00:03:19.840]\nWell, yeah. I mean, it's like an alien civilization might just give us, like, a bug infestation. You know, it's like, hey, we left. That planet was fine. Now it's got a bunch of bugs. Just go fumigate it, you know, like we fumigate a house. And that's certainly possible. And then but if there are no aliens, well, could it be that all civilizations are just destroyed before they become inter stellar?\n[00:03:42.730]\nYou know? So, uh, and I want to be clear like that. To the best of my knowledge, there is no evidence for alien life on Earth. That alien there's no there's no evidence for alien life. There's no direct evidence.\n[00:03:57.530]\nFor alien life, no. You know, and if somebody says, oh, what about this alien four of, you know, sighting or whatever, I'm like, listen, it's got to be at least as good as a 7-Eleven or ATM cam.\n[00:04:11.230] OK?\n[00:04:12.420]\nIt's like if somebody's got to at least like an iPhone one level camera like something, you know, the problem with that is it's just too easy to fake things today, too.\n[00:04:22.300]\nYeah, sure. At least try hard. And there.\n[00:04:25.930]\nAre you familiar with Commander David Fraser's account of the Tic-Tac UFO that he encountered off of the coast of San Diego? Like, you know, Lex Lex Friedemann? Yeah, Lex Freedman interviewed him on his podcast and I interviewed him as well. And if you ever get a chance to listen to Lex's conversation with him, it's really excellent. But this guy is a naval fighter pilot, and he talked about this thing that they tracked on radar that went from more than 60000 feet above sea level to one foot and less than a second shaped like a Tic TAC.\n[00:04:59.320]\nNo visible sign of propulsion, blocked radar, actively jammed their tracking systems and then went to their predetermined point that they were supposed to that the the fighter jet was supposed to scramble to went to it 30 miles away and, you know, a couple seconds like they have no idea how it did it. They don't know what it is. And these guys that were working for the Navy off the coast said they encountered them several times. They didn't know what they were.\n[00:05:30.220]\nThey didn't know what to do, what I just did or something. I mean, they do they have video of it, OK? They have video of it. They have. There's you ever see the New York Times article that came out in twenty seventeen about the stuff?\n[00:05:42.790]\nI don't know. Yeah, there was a New York Times article in twenty seventeen that was detailing this, and there's a couple of there's a couple other different sightings that were very similar. They were trying to figure out what these things were and why. And it was also in the covid relief package that the CIA was supposed to release. Yeah, politicians are trying to figure out what all this shit is. So they try to get them to release all the information they have within 180 days.\n[00:06:09.670]\nHonestly, I think I would know if there were aliens. I would hope so.\n[00:06:13.630]\nThat's why I'm asking. You know, I I'd be jumping on that like like you should watch that conversation with Lex.\n[00:06:21.040]\nIt's like here's the thing.\n[00:06:23.620]\n\nDo you think that they would want us to know or do you think they would just be observing and making sure we don't blow ourselves up, would we?\n[00:06:31.780]\nI don't know of any real civilization. They sure.\n[00:06:33.580]\nOur subtle I mean, if they wanted us to know, obviously they could just show up and walk down Main Street, you know, hey, I'm an alien. Check me out, you know, right. Here's my spaceship. I just land in the middle of Times Square. I'd be like, right, OK. Or hover over downtown L.A.. Yeah, yeah.\n[00:06:50.890]\nWe were like, OK, we believe you. Yeah. So whatever are they are very subtle, very subtle because aliens.\n[00:06:59.620]\nHow often do you think about it. Nine zero zero.\n[00:07:02.740]\nEven though you're thinking about interplanetary travel, you don't really think about aliens.\n[00:07:07.600]\nNo. I mean if they show up I'm like, great, OK, now this is new information.\n[00:07:12.040]\nBut you know what an interesting way of putting this is new information, this new information like where are you guys up till now? Yeah. So anyway, listen, if I see some evidence for aliens, I'll be like I'll be the first to be like aliens, you know?\n[00:07:33.820]\nRight. Then you'll investigate. But until then, you think it's kind of a waste of time. Yeah, yeah. It definitely seems like a waste of time if nothing's happened so far. You think about all the people that I've been researching aliens for their whole life and they have very little to show for it.\n[00:07:49.060]\nWell, you know, there's other than cool stories. Yeah.\n[00:07:54.790]\nI mean, we have archaeologist going all over the world looking at things. You know, there's this people like if we were to find something like let's say like a cube of titanium, just like a one inch Cuba titanium, it's in the middle of the pyramid. I feel like aliens for sure. There's no way they could have made titanium back. There is no way. That's hard. That's all one do don't even need a computer like a computer would be like, hey, while computers, they didn't have computers back then.\n[00:08:21.170]\nSo it must be aliens. But but even just like some advanced metallurgy, anything like anything like that. Right.\n[00:08:30.960]\nNothing like that that we could point to that we can't do everything that we found archaeologically is consistent with the time, the technology they had at that time. Archeologically.\n[00:08:44.130]\nYeah. Yeah. So you just talk about old stuff. Yeah. Yeah. Just throughout history, it's not like, you know, like aliens. They have something buried somewhere. I think we haven't seen anything. So anyway, I mean maybe there are aliens but they're are very subtle.\n\n[00:09:01.070]\nIf there are they're just very they're being pretty shy so far as we can tell is not so, nor are we seeing signals from any other solar system or anything like that.\n[00:09:15.220]\nSo now and the things that on a galactic time scale, even with stuff like travel, you could absolutely colonize the whole galaxy, even some of the neighboring galaxies. So if you gave if you said a million years with with with and say there's there's no new physics, could you colonize the galaxy in a million years?\n[00:09:38.900]\nAbsolutely. The entire galaxy.\n[00:09:40.820]\nSo you would start with Mars, build bases on Mars and use Mars to jump off all these other planets, set up places there and over thousands of years, it's kind of like, you know, Sofra one solar system to the next.\n[00:09:53.450] And yeah, that.\n[00:09:55.710]\nIt seems like that's. Imperative like that has to happen if the human civilization is going to survive because our planet is just we're too subject to natural disasters and our own folly. And if this species is going to survive, we kind of have to escape.\n[00:10:10.870]\nIt's mostly about the species. I mean, there have been some real doozies of like, you know, massive meteors and super volcanoes and the continents move all over the place.\n[00:10:22.300]\nAnd it's been a snowball and super hot.\n[00:10:25.120]\nBut if you read, like the geological history of Earth, it's like very long and complicated. So and there have been so many extinction events. Not like just a few. Yeah. I mean, the the Permian extinction event, that was a real rough one where it's like well over 90 percent of all species died out.\n[00:10:49.090]\nAnd that doesn't tell the whole story because a huge chunk of the remaining species were fungi and, you know, like sponges and stuff like that. You know, like if you are you are you a sponge? OK, you're probably doing OK. They're still around. Are you a mushroom? Is it do you like being in the dark and feasting on dead, dead, dead plant animal matter? OK, but if you're like a human, you're screwed.\n[00:11:16.660]\nCatch new episodes.\n[00:11:17.890]\nThe Joe Rogan experience for free only on Spotify. Watch back catalogue Jarry videos on Spotify, including clips easily, seamlessly switch between video and audio experience on Spotify. You can listen to the jury in the background by using other apps and can download episodes to save on data cost all for free. Spotify is absolutely free. You don't have to have a premium account to watch New Jersey episodes. You just need to search for the jury on your Spotify app. Go to Spotify now to get this full episode of the Joe Rogan experience.\n"
  },
  {
    "title": "Elon Musk / Joe Rogan",
    "content": "[00:00:00.090]\nHow much time before there's regular travel back and forth to Mars? Roughly. Like a real civilization on Mars.\n[00:00:17.240]\nWell, I think it's going to take a while to build a real civilization that the real of the threshold that really matters is if we're getting past the great filter is do we have enough resources on Mars such that if the if the spaceships from Earth stop coming, you could survive?\n[00:00:41.400]\nYeah. So that can only be just missing one little thing.\n[00:00:45.810]\nYou'd be like you're on a long sea voyage and the only thing you're missing is vitamin C. Uh, it's only a matter of time, you know. Yeah. And those can be curtains. So you've got to have all the things necessary to sustain civilization on Mars.\n[00:01:03.800]\nAnd the reason that those ships stopped coming could be. World War three, or it could be due to a slow decline of civilization, so civilization here on Earth could end with a bang or a whimper or natural disasters.\n[00:01:19.190]\nYeah, asteroid impacts in the bank category. Yeah, it could be like a whole series of things like. So like what killed the dinosaurs. Well, it wasn't just one thing, you know, it was like a whole bunch of things happened in a row and. You know, while they could have taken any one of those things, they had like three things happen and no dinosaurs, which is kind of amazing that crocodiles are still here.\n[00:01:45.070]\nYeah, those fuckers, well, they're resilient crocodiles that they all that live on decayed meat and they love rotting meat. And so in a any kind of disastrous situation, there's a lot of dead creatures and the crocodiles love it. So that's why they're around crocodiles and bugs and mushrooms and shrews truths, which is why we're here. Yeah, exactly.\n[00:02:14.440]\nOur great, great, great, great, great, great grandparents were. What a strange thing someone like you had to come from. So there's hope.\n[00:02:22.120]\nThere's hope for all you rodents out there. Yeah, well, you can go to Mars. Just keep doing your homework. Absolutely. So so there will be you see the great filter. What did you mean by that?\n[00:02:37.030]\nWell, so there's something called like the Fermi paradox of like, where are the aliens? Yeah. So, you know, where are the aliens? And I think it was Carl Sagan that said, like, if there either are a lot of aliens or none and the either they're equally terrifying. Hmm. If there are a lot of aliens.\n[00:03:05.950]\nWell, I mean, the invasion ship, you know, bug infestation just, you know, like the Starship Troopers style.\n[00:03:19.840]\nWell, yeah. I mean, it's like an alien civilization might just give us, like, a bug infestation. You know, it's like, hey, we left. That planet was fine. Now it's got a bunch of bugs. Just go fumigate it, you know, like we fumigate a house. And that's certainly possible. And then but if there are no aliens, well, could it be that all civilizations are just destroyed before they become inter stellar?\n[00:03:42.730]\nYou know? So, uh, and I want to be clear like that. To the best of my knowledge, there is no evidence for alien life on Earth. That alien there's no there's no evidence for alien life. There's no direct evidence.\n[00:03:57.530]\nFor alien life, no. You know, and if somebody says, oh, what about this alien four of, you know, sighting or whatever, I'm like, listen, it's got to be at least as good as a 7-Eleven or ATM cam.\n[00:04:11.230] OK?\n[00:04:12.420]\nIt's like if somebody's got to at least like an iPhone one level camera like something, you know, the problem with that is it's just too easy to fake things today, too.\n[00:04:22.300]\nYeah, sure. At least try hard. And there.\n[00:04:25.930]\nAre you familiar with Commander David Fraser's account of the Tic-Tac UFO that he encountered off of the coast of San Diego? Like, you know, Lex Lex Friedemann? Yeah, Lex Freedman interviewed him on his podcast and I interviewed him as well. And if you ever get a chance to listen to Lex's conversation with him, it's really excellent. But this guy is a naval fighter pilot, and he talked about this thing that they tracked on radar that went from more than 60000 feet above sea level to one foot and less than a second shaped like a Tic TAC.\n[00:04:59.320]\nNo visible sign of propulsion, blocked radar, actively jammed their tracking systems and then went to their predetermined point that they were supposed to that the the fighter jet was supposed to scramble to went to it 30 miles away and, you know, a couple seconds like they have no idea how it did it. They don't know what it is. And these guys that were working for the Navy off the coast said they encountered them several times. They didn't know what they were.\n[00:05:30.220]\nThey didn't know what to do, what I just did or something. I mean, they do they have video of it, OK? They have video of it. They have. There's you ever see the New York Times article that came out in twenty seventeen about the stuff?\n[00:05:42.790]\nI don't know. Yeah, there was a New York Times article in twenty seventeen that was detailing this, and there's a couple of there's a couple other different sightings that were very similar. They were trying to figure out what these things were and why. And it was also in the covid relief package that the CIA was supposed to release. Yeah, politicians are trying to figure out what all this shit is. So they try to get them to release all the information they have within 180 days.\n[00:06:09.670]\nHonestly, I think I would know if there were aliens. I would hope so.\n[00:06:13.630]\nThat's why I'm asking. You know, I I'd be jumping on that like like you should watch that conversation with Lex.\n[00:06:21.040]\nIt's like here's the thing.\n[00:06:23.620]\n\nDo you think that they would want us to know or do you think they would just be observing and making sure we don't blow ourselves up, would we?\n[00:06:31.780]\nI don't know of any real civilization. They sure.\n[00:06:33.580]\nOur subtle I mean, if they wanted us to know, obviously they could just show up and walk down Main Street, you know, hey, I'm an alien. Check me out, you know, right. Here's my spaceship. I just land in the middle of Times Square. I'd be like, right, OK. Or hover over downtown L.A.. Yeah, yeah.\n[00:06:50.890]\nWe were like, OK, we believe you. Yeah. So whatever are they are very subtle, very subtle because aliens.\n[00:06:59.620]\nHow often do you think about it. Nine zero zero.\n[00:07:02.740]\nEven though you're thinking about interplanetary travel, you don't really think about aliens.\n[00:07:07.600]\nNo. I mean if they show up I'm like, great, OK, now this is new information.\n[00:07:12.040]\nBut you know what an interesting way of putting this is new information, this new information like where are you guys up till now? Yeah. So anyway, listen, if I see some evidence for aliens, I'll be like I'll be the first to be like aliens, you know?\n[00:07:33.820]\nRight. Then you'll investigate. But until then, you think it's kind of a waste of time. Yeah, yeah. It definitely seems like a waste of time if nothing's happened so far. You think about all the people that I've been researching aliens for their whole life and they have very little to show for it.\n[00:07:49.060]\nWell, you know, there's other than cool stories. Yeah.\n[00:07:54.790]\nI mean, we have archaeologist going all over the world looking at things. You know, there's this people like if we were to find something like let's say like a cube of titanium, just like a one inch Cuba titanium, it's in the middle of the pyramid. I feel like aliens for sure. There's no way they could have made titanium back. There is no way. That's hard. That's all one do don't even need a computer like a computer would be like, hey, while computers, they didn't have computers back then.\n[00:08:21.170]\nSo it must be aliens. But but even just like some advanced metallurgy, anything like anything like that. Right.\n[00:08:30.960]\nNothing like that that we could point to that we can't do everything that we found archaeologically is consistent with the time, the technology they had at that time. Archeologically.\n[00:08:44.130]\nYeah. Yeah. So you just talk about old stuff. Yeah. Yeah. Just throughout history, it's not like, you know, like aliens. They have something buried somewhere. I think we haven't seen anything. So anyway, I mean maybe there are aliens but they're are very subtle.\n\n[00:09:01.070]\nIf there are they're just very they're being pretty shy so far as we can tell is not so, nor are we seeing signals from any other solar system or anything like that.\n[00:09:15.220]\nSo now and the things that on a galactic time scale, even with stuff like travel, you could absolutely colonize the whole galaxy, even some of the neighboring galaxies. So if you gave if you said a million years with with with and say there's there's no new physics, could you colonize the galaxy in a million years?\n[00:09:38.900]\nAbsolutely. The entire galaxy.\n[00:09:40.820]\nSo you would start with Mars, build bases on Mars and use Mars to jump off all these other planets, set up places there and over thousands of years, it's kind of like, you know, Sofra one solar system to the next.\n[00:09:53.450] And yeah, that.\n[00:09:55.710]\nIt seems like that's. Imperative like that has to happen if the human civilization is going to survive because our planet is just we're too subject to natural disasters and our own folly. And if this species is going to survive, we kind of have to escape.\n[00:10:10.870]\nIt's mostly about the species. I mean, there have been some real doozies of like, you know, massive meteors and super volcanoes and the continents move all over the place.\n[00:10:22.300]\nAnd it's been a snowball and super hot.\n[00:10:25.120]\nBut if you read, like the geological history of Earth, it's like very long and complicated. So and there have been so many extinction events. Not like just a few. Yeah. I mean, the the Permian extinction event, that was a real rough one where it's like well over 90 percent of all species died out.\n[00:10:49.090]\nAnd that doesn't tell the whole story because a huge chunk of the remaining species were fungi and, you know, like sponges and stuff like that. You know, like if you are you are you a sponge? OK, you're probably doing OK. They're still around. Are you a mushroom? Is it do you like being in the dark and feasting on dead, dead, dead plant animal matter? OK, but if you're like a human, you're screwed.\n[00:11:16.660]\nCatch new episodes.\n[00:11:17.890]\nThe Joe Rogan experience for free only on Spotify. Watch back catalogue Jarry videos on Spotify, including clips easily, seamlessly switch between video and audio experience on Spotify. You can listen to the jury in the background by using other apps and can download episodes to save on data cost all for free. Spotify is absolutely free. You don't have to have a premium account to watch New Jersey episodes. You just need to search for the jury on your Spotify app. Go to Spotify now to get this full episode of the Joe Rogan experience.\n[00:00:00.090]\nHow much time before there's regular travel back and forth to Mars? Roughly. Like a real civilization on Mars.\n[00:00:17.240]\nWell, I think it's going to take a while to build a real civilization that the real of the threshold that really matters is if we're getting past the great filter is do we have enough resources on Mars such that if the if the spaceships from Earth stop coming, you could survive?\n[00:00:41.400]\nYeah. So that can only be just missing one little thing.\n[00:00:45.810]\nYou'd be like you're on a long sea voyage and the only thing you're missing is vitamin C. Uh, it's only a matter of time, you know. Yeah. And those can be curtains. So you've got to have all the things necessary to sustain civilization on Mars.\n[00:01:03.800]\nAnd the reason that those ships stopped coming could be. World War three, or it could be due to a slow decline of civilization, so civilization here on Earth could end with a bang or a whimper or natural disasters.\n[00:01:19.190]\nYeah, asteroid impacts in the bank category. Yeah, it could be like a whole series of things like. So like what killed the dinosaurs. Well, it wasn't just one thing, you know, it was like a whole bunch of things happened in a row and. You know, while they could have taken any one of those things, they had like three things happen and no dinosaurs, which is kind of amazing that crocodiles are still here.\n[00:01:45.070]\nYeah, those fuckers, well, they're resilient crocodiles that they all that live on decayed meat and they love rotting meat. And so in a any kind of disastrous situation, there's a lot of dead creatures and the crocodiles love it. So that's why they're around crocodiles and bugs and mushrooms and shrews truths, which is why we're here. Yeah, exactly.\n[00:02:14.440]\nOur great, great, great, great, great, great grandparents were. What a strange thing someone like you had to come from. So there's hope.\n[00:02:22.120]\nThere's hope for all you rodents out there. Yeah, well, you can go to Mars. Just keep doing your homework. Absolutely. So so there will be you see the great filter. What did you mean by that?\n[00:02:37.030]\nWell, so there's something called like the Fermi paradox of like, where are the aliens? Yeah. So, you know, where are the aliens? And I think it was Carl Sagan that said, like, if there either are a lot of aliens or none and the either they're equally terrifying. Hmm. If there are a lot of aliens.\n[00:03:05.950]\nWell, I mean, the invasion ship, you know, bug infestation just, you know, like the Starship Troopers style.\n[00:03:19.840]\nWell, yeah. I mean, it's like an alien civilization might just give us, like, a bug infestation. You know, it's like, hey, we left. That planet was fine. Now it's got a bunch of bugs. Just go fumigate it, you know, like we fumigate a house. And that's certainly possible. And then but if there are no aliens, well, could it be that all civilizations are just destroyed before they become inter stellar?\n[00:03:42.730]\nYou know? So, uh, and I want to be clear like that. To the best of my knowledge, there is no evidence for alien life on Earth. That alien there's no there's no evidence for alien life. There's no direct evidence.\n[00:03:57.530]\nFor alien life, no. You know, and if somebody says, oh, what about this alien four of, you know, sighting or whatever, I'm like, listen, it's got to be at least as good as a 7-Eleven or ATM cam.\n[00:04:11.230] OK?\n[00:04:12.420]\nIt's like if somebody's got to at least like an iPhone one level camera like something, you know, the problem with that is it's just too easy to fake things today, too.\n[00:04:22.300]\nYeah, sure. At least try hard. And there.\n[00:04:25.930]\nAre you familiar with Commander David Fraser's account of the Tic-Tac UFO that he encountered off of the coast of San Diego? Like, you know, Lex Lex Friedemann? Yeah, Lex Freedman interviewed him on his podcast and I interviewed him as well. And if you ever get a chance to listen to Lex's conversation with him, it's really excellent. But this guy is a naval fighter pilot, and he talked about this thing that they tracked on radar that went from more than 60000 feet above sea level to one foot and less than a second shaped like a Tic TAC.\n[00:04:59.320]\nNo visible sign of propulsion, blocked radar, actively jammed their tracking systems and then went to their predetermined point that they were supposed to that the the fighter jet was supposed to scramble to went to it 30 miles away and, you know, a couple seconds like they have no idea how it did it. They don't know what it is. And these guys that were working for the Navy off the coast said they encountered them several times. They didn't know what they were.\n[00:05:30.220]\nThey didn't know what to do, what I just did or something. I mean, they do they have video of it, OK? They have video of it. They have. There's you ever see the New York Times article that came out in twenty seventeen about the stuff?\n[00:05:42.790]\nI don't know. Yeah, there was a New York Times article in twenty seventeen that was detailing this, and there's a couple of there's a couple other different sightings that were very similar. They were trying to figure out what these things were and why. And it was also in the covid relief package that the CIA was supposed to release. Yeah, politicians are trying to figure out what all this shit is. So they try to get them to release all the information they have within 180 days.\n[00:06:09.670]\nHonestly, I think I would know if there were aliens. I would hope so.\n[00:06:13.630]\nThat's why I'm asking. You know, I I'd be jumping on that like like you should watch that conversation with Lex.\n[00:06:21.040]\nIt's like here's the thing.\n[00:06:23.620]\n\nDo you think that they would want us to know or do you think they would just be observing and making sure we don't blow ourselves up, would we?\n[00:06:31.780]\nI don't know of any real civilization. They sure.\n[00:06:33.580]\nOur subtle I mean, if they wanted us to know, obviously they could just show up and walk down Main Street, you know, hey, I'm an alien. Check me out, you know, right. Here's my spaceship. I just land in the middle of Times Square. I'd be like, right, OK. Or hover over downtown L.A.. Yeah, yeah.\n[00:06:50.890]\nWe were like, OK, we believe you. Yeah. So whatever are they are very subtle, very subtle because aliens.\n[00:06:59.620]\nHow often do you think about it. Nine zero zero.\n[00:07:02.740]\nEven though you're thinking about interplanetary travel, you don't really think about aliens.\n[00:07:07.600]\nNo. I mean if they show up I'm like, great, OK, now this is new information.\n[00:07:12.040]\nBut you know what an interesting way of putting this is new information, this new information like where are you guys up till now? Yeah. So anyway, listen, if I see some evidence for aliens, I'll be like I'll be the first to be like aliens, you know?\n[00:07:33.820]\nRight. Then you'll investigate. But until then, you think it's kind of a waste of time. Yeah, yeah. It definitely seems like a waste of time if nothing's happened so far. You think about all the people that I've been researching aliens for their whole life and they have very little to show for it.\n[00:07:49.060]\nWell, you know, there's other than cool stories. Yeah.\n[00:07:54.790]\nI mean, we have archaeologist going all over the world looking at things. You know, there's this people like if we were to find something like let's say like a cube of titanium, just like a one inch Cuba titanium, it's in the middle of the pyramid. I feel like aliens for sure. There's no way they could have made titanium back. There is no way. That's hard. That's all one do don't even need a computer like a computer would be like, hey, while computers, they didn't have computers back then.\n[00:08:21.170]\nSo it must be aliens. But but even just like some advanced metallurgy, anything like anything like that. Right.\n[00:08:30.960]\nNothing like that that we could point to that we can't do everything that we found archaeologically is consistent with the time, the technology they had at that time. Archeologically.\n[00:08:44.130]\nYeah. Yeah. So you just talk about old stuff. Yeah. Yeah. Just throughout history, it's not like, you know, like aliens. They have something buried somewhere. I think we haven't seen anything. So anyway, I mean maybe there are aliens but they're are very subtle.\n\n[00:09:01.070]\nIf there are they're just very they're being pretty shy so far as we can tell is not so, nor are we seeing signals from any other solar system or anything like that.\n[00:09:15.220]\nSo now and the things that on a galactic time scale, even with stuff like travel, you could absolutely colonize the whole galaxy, even some of the neighboring galaxies. So if you gave if you said a million years with with with and say there's there's no new physics, could you colonize the galaxy in a million years?\n[00:09:38.900]\nAbsolutely. The entire galaxy.\n[00:09:40.820]\nSo you would start with Mars, build bases on Mars and use Mars to jump off all these other planets, set up places there and over thousands of years, it's kind of like, you know, Sofra one solar system to the next.\n[00:09:53.450] And yeah, that.\n[00:09:55.710]\nIt seems like that's. Imperative like that has to happen if the human civilization is going to survive because our planet is just we're too subject to natural disasters and our own folly. And if this species is going to survive, we kind of have to escape.\n[00:10:10.870]\nIt's mostly about the species. I mean, there have been some real doozies of like, you know, massive meteors and super volcanoes and the continents move all over the place.\n[00:10:22.300]\nAnd it's been a snowball and super hot.\n[00:10:25.120]\nBut if you read, like the geological history of Earth, it's like very long and complicated. So and there have been so many extinction events. Not like just a few. Yeah. I mean, the the Permian extinction event, that was a real rough one where it's like well over 90 percent of all species died out.\n[00:10:49.090]\nAnd that doesn't tell the whole story because a huge chunk of the remaining species were fungi and, you know, like sponges and stuff like that. You know, like if you are you are you a sponge? OK, you're probably doing OK. They're still around. Are you a mushroom? Is it do you like being in the dark and feasting on dead, dead, dead plant animal matter? OK, but if you're like a human, you're screwed.\n[00:11:16.660]\nCatch new episodes.\n[00:11:17.890]\nThe Joe Rogan experience for free only on Spotify. Watch back catalogue Jarry videos on Spotify, including clips easily, seamlessly switch between video and audio experience on Spotify. You can listen to the jury in the background by using other apps and can download episodes to save on data cost all for free. Spotify is absolutely free. You don't have to have a premium account to watch New Jersey episodes. You just need to search for the jury on your Spotify app. Go to Spotify now to get this full episode of the Joe Rogan experience.\n"
  }
]
